/****************************************Copyright (c)***************************************
**                                 http://www.openmcu.com
**-------------------------------------------------------------------------------------------
** File name:           main.c
** Last modified Date:  2012-12-28
** Last Version:        V1.0
** Descriptions:        红龙407开发板 STOP模式测试
**
**-------------------------------------------------------------------------------------------
** Created by:          FXL
** Last modified Date:  2012-12-28
** Last Version:        V1.0
** Descriptions:        红龙407开发板 STOP模式测试
**
**-------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:             
** Descriptions:        
**-------------------------------------------------------------------------------------------
********************************************************************************************/
#include "stm32f4xx.h"
#include "Gpio.h"
#include "Stop.h"

int main(void)
{
    LEDGpio_Init();         //LED初始化
    StopMode_test();        //STOP模式测试
}



