/****************************************Copyright (c)***************************************
**                                 http://www.openmcu.com
**-------------------------------------------------------------------------------------------
** File name:           main.c
** Last modified Date:  2013-1-25
** Last Version:        V1.0
** Descriptions:        红龙407开发板 WWDG 窗口看门狗使用参考例程
**
**-------------------------------------------------------------------------------------------
** Created by:          FXL
** Last modified Date:  2013-1-25
** Last Version:        V1.0
** Descriptions:        红龙407开发板 WWDG 窗口看门狗使用参考例程
**
**-------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:             
** Descriptions:        
**-------------------------------------------------------------------------------------------
********************************************************************************************/
#include "stm32f4xx.h"
#include "Gpio.h"
#include "WWDG.h"

int main(void)
{
    LEDGpio_Init();           //GPIO初始化
    WWDG_Test();              //窗口看门狗初始化

    while (1)
    {
    }
}
